package com.yongtang.baseStudy;

/**
 * @author yongtang
 */
public class IntegerToExpand {
    public static void main(String[] args) {
        //整数拓展  进制   二进制  十进制   八进制  十六进制
        int i =10;
        int i2 = 010;
        int i3 = 0x10;
        System.out.println(i);
        System.out.println(i2);
        System.out.println(i3);
        //==============================================================================================================
        //浮点数拓展
        //float 有限  离散   舍入误差   大约  接近但不等于
        //BigDecimal 数学工具类
        //最好完全避免使用浮点数进行比较
        //==============================================================================================================
        float f = 0.1f;
        double d = 1.0/10;
        System.out.println(f==d);
        System.out.println(f);
        System.out.println(d);
        //==============================================================================================================
        //字符拓展
        //所有字符的本质还是数字
        //编码  Unicode表：97 = a 、65 = A
        //U0000  UFFFF
        //==============================================================================================================
        char c1 = 'a';
        char c2 = '中';
        char c3 = '\u0061';
        System.out.println(c1);
        System.out.println(c2);
        System.out.println(c3);
        System.out.println((int)c2);
        System.out.println((int)c1);
        //==============================================================================================================
        //转义字符
        //\t  制表符    \n   换行  ...
        //==============================================================================================================
        System.out.println("Hello\tWorld");
        //==============================================================================================================
        //对象  从内存分析
        //==============================================================================================================
        String sa =new String("hello world");
        String sb =new String("hello world");
        System.out.println(sa==sb);
        String sc = "hello world";
        String sd = "hello world";
        System.out.println(sc==sd);
        //==============================================================================================================
        //布尔值扩展
        //Less is More!代码要精简易读
        //==============================================================================================================
        boolean flag = true;
        if (flag==true){
        }
        if (flag){
        }
    }
}
