package com.yongtang.processControl;
//======================================================================================================================
//java.util.Scanner是Java5的新特性，我们可以通过Scanner类来获取用户的输入
//======================================================================================================================

import java.util.Scanner;

/**
 * @author yongtang
 */
public class ProcessControl {
    public static void main(String[] args) {
        //创建一个扫描器对象，用于接收键盘数据
        Scanner scanner = new Scanner(System.in);
        //==============================================================================================================
        //         System.out.println("使用next方式接收：");
        //         使用next方式接收
        //         if (scanner.hasNext()){
        //            String str = scanner.next();
        //            System.out.println("输出内容为："+str);
        //         }
        //==============================================================================================================
        //   next():
        //        1、一定要读取到有效字符后才可以结束输入。
        //        2、对于输入有效字符之前遇到的空白，next()方法会自动将其去掉。
        //        3、只有输入有效字符后才将其后面的空白作为分隔符或者结束符。
        //        4、next()不能得到带有空格的字符串。
        //   nextLine():
        //        1、以Enter为结束符，也就是说nextLine()方法返回的是输入回车之前的所有字符；
        //        2、可以获得空白。
        //==============================================================================================================
        //判断用户有没有输入字符串
        System.out.println("使用nextLine方式接收：");
        if (scanner.hasNextLine()){
            //使用nextLine方式接收
            String str = scanner.nextLine();
            System.out.println("输出内容为："+str);
        }
        //凡是属于I/O流的类如果不关闭会一直占用资源，要养成好习惯，用完就关掉。
        scanner.close();
    }
}
