package com.yongtang.processControl;
//======================================================================================================================
//while是最基本的循环，它的结构为：
//while(布尔表达式){
//   循环内容
// }
//只要布尔表达式为true，循环就会一直执行下去。
//我们大多数情况是会让循环停止下来的，我们需要一个让表达式失效的方式来结束循环。
//少部分需要循环一直进行下去，比如服务器的请求响应监听等。
//循环条件一直true就会造成无限循环【死循环】，我们正常的业务编程过程中应该尽量避免死循环。会影响程序性能或者造成程序卡死奔溃！
//======================================================================================================================

/**
 * @author yongtang
 */
public class WhileCirculation {
    public static void main(String[] args) {
        int i = 0;
        int num = 0;
        while (i<=100){
            num = num + i;
            i++;
        }
        System.out.println(num);
        //==============================================================================================================
        //对于while语句而言，如果不满足条件，则不能进入循环。但有时候我们需要即使不满足条件也至少循环一次。
        //do...while循环和while循环相似，不同的是，do...while循环至少会执行一次。
        //do{
        //     代码语句
        // }while（布尔表达式）；
        //while和do...while的区别：
        //while先判断后执行。do...while是先执行后判断！
        //do...while总是保证循环体会至少被执行一次！这是他们的主要差别。
        //==============================================================================================================
        int a = 0;
        int num2 = 0;
        do {
            num2 = num2 + a;
            a++;
        }while (a<=100);
        System.out.println(num2);
    }
}